simait/TinyTimber/env/m16c/iom16c62.h
union st_ad0 {				 /* A/D register 0 16 bit 						*/
   struct{
	unsigned char AD0L;      /* A/D register 0 low  8 bit 					*/
	unsigned char AD0H;      /* A/D register 0 high 8 bit 					*/
   }BYTE;					 /* Byte access					    			*/
   unsigned short   WORD;	 /* Word Access					    			*/
};

 union st_ad1 {				 /* A/D register 1 16 bit 						*/
   struct{
	unsigned char AD1L;      /* A/D register 1 low  8 bit 					*/
	unsigned char AD1H;      /* A/D register 1 high 8 bit 					*/
   } BYTE;					 /* Byte access					    			*/
   unsigned short   WORD;	 /* Word Access					    			*/
};


union st_ad2 {				 /* A/D register 2 16 bit 						*/
  struct{
	unsigned char AD2L;      /* A/D register 2 low  8 bit 					*/
	unsigned char AD2H;      /* A/D register 2 high 8 bit 					*/
  } BYTE;					 /* Byte access					    			*/
  unsigned short   WORD;	 /* Word Access					    			*/
};

union st_ad3 {			     /* A/D register 3 16 bit 						*/
  struct{
	unsigned char AD3L;      /* A/D register 3 low  8 bit 					*/
	unsigned char AD3H;      /* A/D register 3 high 8 bit 					*/
  } BYTE;					 /* Byte access					    			*/
	unsigned short   WORD;	 /* Word Access					    			*/
};

union st_ad4 {			     /* A/D register 4 16 bit 						*/
  struct{
	unsigned char AD4L;      /* A/D register 4 low  8 bit 					*/
	unsigned char AD4H;      /* A/D register 4 high 8 bit 					*/
  } BYTE;				     /* Byte access					   				*/
  unsigned short   WORD;	 /* Word Access					    			*/
};

union st_ad5 {				 /* A/D register 5 16 bit 						*/
  struct{
	unsigned char AD5L;      /* A/D register 5 low  8 bit 					*/
	unsigned char AD5H;      /* A/D register 5 high 8 bit 					*/
  } BYTE;					 /* Byte access					   				*/
	unsigned short   WORD;	 /* Word Access					   				*/
};

union st_ad6 {				 /* A/D register 6 16 bit 						*/
   struct{
	unsigned char AD6L;      /* A/D register 6 low  8 bit 					*/
	unsigned char AD6H;      /* A/D register 6 high 8 bit 					*/
   } BYTE;					 /* Byte access					    			*/
   unsigned short   WORD;	 /* Word Access					    			*/
 };

union st_ad7 {				 /* A/D register 7 16 bit 						*/
   struct{
	unsigned char AD7L;      /* A/D register 7 low  8 bit 					*/
	unsigned char AD7H;      /* A/D register 7 high 8 bit 					*/
   } BYTE;					 /* Byte access					    			*/
   unsigned short   WORD;	 /* Word Access					    			*/
 };


union st_dm0con {		       /* DMA0 control register union 				*/
   struct{
     unsigned char    DMBIT:1; /* Transfer unit bit select bit 				*/
     unsigned char    DMASL:1; /* Repeat transfer mode select bit 			*/
     unsigned char    DMAS :1; /* DMA request bit 							*/
     unsigned char    DMAE :1; /* DMA enable bit 							*/
     unsigned char    DSD  :1; /* Source address direction select bit   	*/
     unsigned char    DAD  :1; /* Destination address direction select bit  */
     unsigned char    	   :1;
     unsigned char         :1;
   }BIT;
    unsigned char  BYTE;
};

union st_dm1con {		/*    DMA1 control register union */
    struct{
     unsigned char    DMBIT:1; /* Transfer unit bit select bit 				*/
     unsigned char    DMASL:1; /* Repeat transfer mode select bit 			*/
     unsigned char    DMAS :1; /* DMA request bit 							*/
     unsigned char    DMAE :1; /* DMA enable bit 							*/
     unsigned char    DSD  :1; /* Source address direction select bit  		*/
     unsigned char    DAD  :1; /* Destination address direction select bit  */
     unsigned char    	   :1;
     unsigned char         :1;
    }BIT;
    unsigned char  BYTE;
};

union st_dm0sl {			  /*    DMAi request cause select registers			*/
    struct{
     unsigned char    DSEL0:1;/* DMA request cause select bit 				*/
     unsigned char    DSEL1:1;/* DMA request cause select bit 				*/
     unsigned char    DSEL2:1;/* DMA request cause select bit 				*/
     unsigned char    DSEL3:1;/* DMA request cause select bit 				*/
     unsigned char         :1;
     unsigned char         :1;
     unsigned char    DMS  :1;/* DMA request cause expansion bit 			*/
     unsigned char    DSR  :1;/* Software DMA request bit 					*/
    }BIT;
     unsigned char  BYTE;
};


union st_dm1sl {			   /*    DMAi request cause select registers	*/
    struct{
     unsigned char    DSEL0:1; /* DMA request cause select bit 				*/
     unsigned char    DSEL1:1; /* DMA request cause select bit 				*/
     unsigned char    DSEL2:1; /* DMA request cause select bit 				*/
     unsigned char    DSEL3:1; /* DMA request cause select bit 				*/
     unsigned char     	   :1;
     unsigned char    	   :1;
     unsigned char    DMS  :1; /* DMA request cause expansion bit 			*/
     unsigned char    DSR  :1; /* Software DMA request bit 					*/
    }BIT;
    unsigned char  BYTE;
};


union st_icr {		     	   /*    interrupt control registers	  */
    struct{
     unsigned char    ILVL0:1; /* Interrupt priority level select bit */
     unsigned char    ILVL1:1; /* Interrupt priority level select bit */
     unsigned char    ILVL2:1; /* Interrupt priority level select bit */
     unsigned char    IR   :1; /* Interrupt request bit 			  */
     unsigned char    POL  :1; /* Polarity select bit 				  */
     unsigned char    LVS  :1;
     unsigned char    	   :1; /* Nothing assigned					  */
     unsigned char         :1; /* Nothing assigned					  */
    }BIT;
    unsigned char    BYTE;
};



union st_tbsr {              /* union tbsr    	   					*/
	struct {                 /* Bit  Access 		   				*/
	 unsigned char 		:1;  /* Nothing Assigned					*/
	 unsigned char 		:1;  /* Nothing Assigned					*/
	 unsigned char 		:1;  /* Nothing Assigned					*/
	 unsigned char 		:1;  /* Nothing Assigned					*/
	 unsigned char 		:1;  /* Nothing Assigned					*/
	 unsigned char 	TB3S:1;  /* Timer B3 count start flag 			*/
	 unsigned char 	TB4S:1;  /* Timer B4 count start flag 			*/
	 unsigned char 	TB5S:1;  /* Timer B5 count start flag 			*/
	} BIT;   		         /*        						    	*/
	unsigned  char BYTE;     /*  Byte Access 						*/
};                           /* Timer B3,4,5 Count start flag       */

