simait/TinyTimber/env/m16c/iom16c62.h
/*------------------------------------------------------
   SI/O4 control registers
------------------------------------------------------*/
union st_s4c {              /* union S4C    	   						*/
	struct {   		        /* Bit  Access 		   						*/
	 unsigned char 	SM40:1; /* Internal synchronous clock select bit 	*/
	 unsigned char	SM41:1; /* Internal synchronous clock select bit 	*/
	 unsigned char	SM42:1; /* Sout4 output disable bit					*/
	 unsigned char	SM43:1; /* SI/O4 port select bit 					*/
	 unsigned char		:1; /* Nothing assigned							*/
	 unsigned char	SM45:1; /* Transfer direction select bit 			*/
	 unsigned char	SM46:1; /* Synchronous clock select bit 			*/
	 unsigned char	SM47:1; /* Sout4 initial value set bit 				*/
	} BIT;   		    	/*        						    		*/
	unsigned char BYTE;     /*  Byte Access 							*/
};

/*------------------------------------------------------
    UART2 special mode register 3
------------------------------------------------------*/
union st_u2smr3 {           /* union U2SMR3    	   					*/
	struct {            	/* Bit  Access 		   					*/
	 unsigned char 		:1; /* 										*/
	 unsigned char		:1; /* 										*/
	 unsigned char		:1; /* 										*/
	 unsigned char		:1; /* 										*/
	 unsigned char		:1; /* 										*/
	 unsigned char	 DL0:1; /* SDA digital delay setup bit 			*/
	 unsigned char	 DL1:1; /* SDA digital delay setup bit 			*/
	 unsigned char	 DL2:1; /* SDA digital delay setup bit 			*/
	} BIT;   		    	/*        						    	*/
	unsigned char BYTE;     /*  Byte Access 						*/
};                          /* 						            	*/

/*------------------------------------------------------
    UART2 special mode register 2
------------------------------------------------------*/
union st_u2smr2 {            /* union U2SMR2    	   					*/
	struct {	             /* Bit  Access 		   					*/
	 unsigned char 	IICM2:1; /* IIC mode selection bit 2				*/
	 unsigned char	CSC  :1; /* Clock-synchronous bit 					*/
	 unsigned char	SWC  :1; /* SCL wait output bit 					*/
	 unsigned char	ALS  :1; /* SDA output stop bit 					*/
	 unsigned char	STAC :1; /* UART2 initialization bit 				*/
	 unsigned char	SWC2 :1; /* SCL wait output bit 2 					*/
	 unsigned char	SDHI :1; /* SDA output disable bit					*/
	 unsigned char	SHTC :1; /* Start/stop condition control bit 		*/
	} BIT;   			     /*        						    		*/
	unsigned char BYTE;      /*  Byte Access 							*/
};                           /* 						            	*/

/*------------------------------------------------------
    UART2 special mode register
------------------------------------------------------*/
union st_u2smr {             /* union U2SMR    	   							*/
	struct {             	 /* Bit  Access 		  	 					*/
	 unsigned char 	IICM :1; /* IIC mode selection bit						*/
	 unsigned char	ABC  :1; /* Arbitration lost detecting flag control bit */
	 unsigned char	BBS  :1; /* Bus busy flag 								*/
	 unsigned char	LSYN :1; /* SCLL sync output enable bit 				*/
	 unsigned char	ABSCS:1; /* Bus collision detect sampling clock select bit */
	 unsigned char	ACSE :1; /* Auto clear function select bit of transmit enable bit */
	 unsigned char	SSS  :1; /* Transmit start condition select bit			*/
	 unsigned char	SDDS :1; /* SDA digital delay select bit 				*/
	} BIT;   		     	 /*        						 		   		*/
	unsigned char BYTE;      /*  Byte Access 								*/
};                           /* 						     		       	*/


/*------------------------------------------------------
    UARTi transmit/receive mode register
------------------------------------------------------*/
union st_u2mr {              	  /* union U2MR	   							*/
	struct {             	      /* Bit  Access	  	 					*/
	 unsigned char 	SMD0_U2MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char	SMD1_U2MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char	SMD2_U2MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char	CKDIR_U2MR:1; /* Internal/external clock select bit		*/
	 unsigned char	STPS_U2MR :1; /* Stop bit length select bit 			*/
	 unsigned char	PRY_U2MR  :1; /* Odd/even parity select bit 			*/
	 unsigned char	PRYE_U2MR :1; /* Parity enable bit 						*/
	 unsigned char	IOPOL_U2MR:1; /* TxD RxD I/O polarity reverse bit 		*/
	} BIT;   		     		  /*        						 		   		*/
	unsigned char BYTE;           /*  Byte Access							*/
};

/*------------------------------------------------------
     u1mr
------------------------------------------------------*/
union st_u1mr {              	  /* union U1MR	   							*/
	struct {             	 	  /* Bit  Access	  	 					*/
	 unsigned char 	SMD0_U1MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char	SMD1_U1MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char	SMD2_U1MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char	CKDIR_U1MR:1; /* Internal/external clock select bit 	*/
	 unsigned char	STPS_U1MR :1; /* Stop bit length select bit 			*/
	 unsigned char	PRY_U1MR  :1; /* Odd/even parity select bit 			*/
	 unsigned char	PRYE_U1MR :1; /* Parity enable bit 						*/
	 unsigned char	SLEP_U1MR :1; /* Sleep select bit 						*/
	} BIT;   		     	  	  /*   						 		   		*/
	unsigned char BYTE;           /* Byte Access 							*/
};


/*------------------------------------------------------
    u0mr
------------------------------------------------------*/
union st_u0mr {              	  /* union U0MR	   							*/
	struct {             	      /* Bit  Access	  	 					*/
	 unsigned char 	SMD0_U0MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char 	SMD1_U0MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char 	SMD2_U0MR :1; /* Serial I/O mode select bit 			*/
	 unsigned char 	CKDIR_U0MR:1; /* Internal/external clock select bit 	*/
	 unsigned char 	STPS_U0MR :1; /* Stop bit length select bit 			*/
	 unsigned char 	PRY_U0MR  :1; /* Odd/even parity select bit 			*/
	 unsigned char 	PRYE_U0MR :1; /* Parity enable bit 						*/
	 unsigned char 	SLEP_U0MR :1; /* Sleep select bit 						*/
	} BIT;   		     	  	  /*   						 		   		*/
	unsigned char BYTE;           /* Byte Access 							*/
};

