simait/TinyTimber/env/m16c/iom16c62.h
/*------------------------------------------------------
    UARTi transmit/receive control register 0
------------------------------------------------------*/
union st_u0c0 {              	/* union U0C0	   							*/
	struct {             		/* Bit  Access	  	 						*/
	 unsigned char 	CLK0 :1; 	/* BRG count source select bit 				*/
	 unsigned char	CLK1 :1; 	/* BRG count source select bit 				*/
	 unsigned char	CRS  :1; 	/* CTS~/RTS~ function select bit 			*/
	 unsigned char	TXEPT:1; 	/* Transmit register empty flag 			*/
	 unsigned char	CRD  :1; 	/* CTS~/RTS~ disable bit 					*/
	 unsigned char	NCH  :1; 	/* Data output select bit 					*/
	 unsigned char	CKPOL:1; 	/* CLK polarity select bit 					*/
	 unsigned char	UFORM:1; 	/* Transfer format select bit 				*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;         /* Byte Access 								*/
}; 								/*UARTi transmit/receive control register 0 */

/*------------------------------------------------------
     u1c0
------------------------------------------------------*/
union st_u1c0 {              	/* union UCR	   							*/
	struct {             		/* Bit  Access	  	 						*/
	 unsigned char 	CLK0 :1; 	/* BRG count source select bit 				*/
	 unsigned char	CLK1 :1; 	/* BRG count source select bit 				*/
	 unsigned char	CRS  :1; 	/* CTS~/RTS~ function select bit 			*/
	 unsigned char	TXEPT:1; 	/* Transmit register empty flag 			*/
	 unsigned char	CRD  :1; 	/* CTS~/RTS~ disable bit 					*/
	 unsigned char	NCH  :1; 	/* Data output select bit 					*/
	 unsigned char	CKPOL:1; 	/* CLK polarity select bit 					*/
	 unsigned char	UFORM:1; 	/* Transfer format select bit 				*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;         /* Byte Access 								*/
}; 								/*UARTi transmit/receive control register 0 */


/*------------------------------------------------------
     u2c0
------------------------------------------------------*/
union st_u2c0 {              	/* union U2C0	   							*/
	struct {             		/* Bit  Access	  	 						*/
	 unsigned char 	CLK0 :1; 	/* BRG count source select bit 				*/
	 unsigned char	CLK1 :1; 	/* BRG count source select bit 				*/
	 unsigned char	CRS  :1; 	/* CTS~/RTS~ function select bit 			*/
	 unsigned char	TXEPT:1; 	/* Transmit register empty flag 			*/
	 unsigned char	CRD  :1; 	/* CTS~/RTS~ disable bit 					*/
	 unsigned char		 :1; 	/* Nothing Assigned							*/
	 unsigned char	CKPOL:1; 	/* CLK polarity select bit 					*/
	 unsigned char	UFORM:1; 	/* Transfer format select bit 				*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;         /* Byte Access 								*/
}; 								/* UART2 transmit/receive control register 0*/

/*------------------------------------------------------
    UART2 transmit/receive control register 1
-----------------------------------------------------*/
union st_u2c1 {              	/* union U2C1	   							*/
	struct {             		/* Bit  Access	  	 						*/
	 unsigned char 	TE_U2C1:1; 	/* Transmit enable bit 						*/
	 unsigned char	TI_U2C1:1; 	/* Transmit buffer empty flag 				*/
	 unsigned char	RE_U2C1:1; 	/* Receive enable bit 						*/
	 unsigned char	RI_U2C1:1; 	/* Receive complete flag 					*/
	 unsigned char	U2IRS  :1; 	/* UART2 transmit interrupt cause select bit*/
	 unsigned char	U2RRM  :1; 	/* UART2 continuous receive mode enable bit */
	 unsigned char	U2LCH  :1; 	/* Data logic select bit 					*/
	 unsigned char	U2ERE  :1; 	/* Error signal output enable bit 			*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;         /* Byte Access 								*/
}; 								/*UART2 transmit/receive control register 1 */

/*------------------------------------------------------
    UARTi receive buffer registers
------------------------------------------------------*/
union st_u2rb {     				/* UART2 receive buffer register */
    struct {						/*  Bit  Access */
	 unsigned char 			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char   		:1;		/*  Receive data       				*/
	 unsigned char   		:1;		/* Nothing assigned	   				*/
	 unsigned char   		:1;		/* Nothing assigned	   				*/
 	 unsigned char  ABT_U2RB:1;     /* Arbitration lost detecting flag  */
 	 unsigned char  OER_U2RB:1;     /* Overrun error flag 				*/
 	 unsigned char  FER_U2RB:1;     /* Framing error flag				*/
 	 unsigned char  PER_U2RB:1;     /* Parity error flag 				*/
 	 unsigned char  SUM_U2RB:1;     /* Error sum flag 					*/
    }BIT;
    struct{
 	 unsigned char    U2RBL;        /* Low  8 bit						*/
 	 unsigned char    U2RBH;        /* High 8 bit 						*/
    }BYTE;
    unsigned short  WORD;
};

/*------------------------------------------------------
     u0rb
------------------------------------------------------*/
union st_u0rb {						/*  UART0 receive buffer register 	*/
    struct {						/*  Bit  Access 				 	*/
	 unsigned char 			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char  		:1;		/*  Receive data       				*/
	 unsigned char  		:1;		/* Nothing assigned	   				*/
	 unsigned char  		:1;		/* Nothing assigned	   				*/
 	 unsigned char          :1;     /* 									*/
 	 unsigned char  OER_U0RB:1;     /* Overrun error flag 				*/
 	 unsigned char  FER_U0RB:1;     /* Framing error flag				*/
 	 unsigned char  PER_U0RB:1;     /* Parity error flag 				*/
 	 unsigned char  SUM_U0RB:1;     /* Error sum flag 					*/
    }BIT;
    struct{
     unsigned char U0RBL;        	/* Low  8 bit 						*/
     unsigned char U0RBH;           /* High 8 bit 						*/
    }BYTE;
    unsigned short  WORD;
};

