simait/TinyTimber/env/m16c/iom16c62.h
/*------------------------------------------------------
     u1rb
------------------------------------------------------*/
union st_u1rb {						/* UART1 receive buffer register */
    struct {						/*  Bit  Access */
	 unsigned char 			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char			:1;		/*  Receive data       				*/
	 unsigned char  		:1;		/*  Receive data       				*/
	 unsigned char  		:1;		/* Nothing assigned	   				*/
	 unsigned char  		:1;		/* Nothing assigned	   				*/
 	 unsigned char          :1;     /* 									*/
 	 unsigned char  OER_U1RB:1;     /* Overrun error flag 				*/
 	 unsigned char  FER_U1RB:1;     /* Framing error flag				*/
 	 unsigned char  PER_U1RB:1;     /* Parity error flag 				*/
 	 unsigned char  SUM_U1RB:1;     /* Error sum flag 					*/
    }BIT;
    struct{
     unsigned char U1RBL;           /* Low  8 bit 						*/
     unsigned char U1RBH;           /* High 8 bit 						*/
    }BYTE;
    unsigned short  WORD;
};

/*------------------------------------------------------
    Count start flag
------------------------------------------------------*/
union st_tabsr {              	/* union TABSR	   							*/
	struct {             		/* Bit  Access	  	 						*/
     unsigned char	TA0S:1; 	/* Timer A0 count start flag 				*/
     unsigned char	TA1S:1; 	/* Timer A1 count start flag 				*/
     unsigned char	TA2S:1; 	/* Timer A2 count start flag 				*/
     unsigned char	TA3S:1; 	/* Timer A3 count start flag 				*/
     unsigned char	TA4S:1; 	/* Timer A4 count start flag 				*/
     unsigned char	TB0S:1; 	/* Timer B0 count start flag 				*/
     unsigned char	TB1S:1; 	/* Timer B1 count start flag 				*/
     unsigned char	TB2S:1; 	/* Timer B2 count start flag 				*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;         /* Byte Access 								*/
}; 								/*UART2 transmit/receive control register 1 */


/*------------------------------------------------------
    Clock prescaler reset flag
------------------------------------------------------*/
union st_cpsrf {              /* union CPSRF    	   						*/
              	struct {      /* Bit  Access		   						*/
     unsigned char 		:1;   /* 											*/
     unsigned char 		:1;   /* 											*/
     unsigned char 		:1;   /* 											*/
     unsigned char 		:1;   /* 											*/
     unsigned char 		:1;   /* 				 							*/
     unsigned char 		:1;   /* 				 							*/
     unsigned char 	 	:1;   /* 											*/
     unsigned char 	CPSR:1;   /* Clock prescaler reset flag 				*/
                } BIT;   	  /*       						    			*/
     unsigned char BYTE;      /* Byte Access 								*/
};                            /* Watchdog timer start register				*/

/*------------------------------------------------------
    One-shot start flag
------------------------------------------------------*/
union st_onsf {              	/* union ONSF	   							*/
	struct {             		/* Bit  Access	  	 						*/
	 unsigned char 	 TA0OS:1; 	/* Timer A0 one-shot start flag 			*/
	 unsigned char 	 TA1OS:1; 	/* Timer A1 one-shot start flag 			*/
	 unsigned char	 TA2OS:1; 	/* Timer A2 one-shot start flag 			*/
	 unsigned char	 TA3OS:1; 	/* Timer A3 one-shot start flag 			*/
	 unsigned char	 TA4OS:1; 	/* Timer A4 one-shot start flag 			*/
	 unsigned char		  :1; 	/* 											*/
	 unsigned char	TA0TGL:1; 	/* Timer A0 event/trigger select bit 		*/
	 unsigned char	TA0TGH:1; 	/* Timer A0 event/trigger select bit 		*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;         /* Byte Access 								*/
}; 								/*UART2 transmit/receive control register 1 */

/*------------------------------------------------------
    Trigger select register
------------------------------------------------------*/
union st_trgsr {              	/* union TRGSR	   							*/
		struct {             	/* Bit  Access	  	 						*/
	 unsigned char 	TA1TGL:1; 	/* Timer A1 event/trigger select bit 		*/
	 unsigned char	TA1TGH:1; 	/* Timer A1 event/trigger select bit 		*/
	 unsigned char	TA2TGL:1; 	/* Timer A2 event/trigger select bit 		*/
	 unsigned char	TA2TGH:1; 	/* Timer A2 event/trigger select bit 		*/
	 unsigned char	TA3TGL:1; 	/* Timer A3 event/trigger select bit 		*/
	 unsigned char	TA3TGH:1; 	/* Timer A3 event/trigger select bit 		*/
	 unsigned char	TA4TGL:1; 	/* Timer A4 event/trigger select bit 		*/
	 unsigned char	TA4TGH:1; 	/* Timer A4 event/trigger select bit 		*/
	} BIT;   			     	/*   						 		   		*/
	unsigned char BYTE;           	/* Byte Access 								*/
}; 								/*UART2 transmit/receive control register 1 */

#if 0
/*------------------------------------------------------
    Timer mode registers
------------------------------------------------------*/
union st_tmr {
    struct{
     unsigned char  TMOD0:1;            /* Operation mode select bit */
     unsigned char  TMOD1:1;            /* Operation mode select bit */
     unsigned char  MR0  :1;
     unsigned char  MR1  :1;
     unsigned char  MR2  :1;
     unsigned char  MR3  :1;
     unsigned char  TCK0 :1;             /* Count source select bit */
     unsigned char  TCK1 :1;             /* Count source select bit */
    }BIT;
    unsigned char    BYTE;
};
#endif
/*------------------------------------------------------
    UARTi transmit/receive control register 1
------------------------------------------------------*/
union st_u0c1 {             /* union U0C1		   							*/
	struct {            	/* Bit  Access	  	 							*/
	 unsigned char 	TE:1; 	/* Transmit enable bit 							*/
	 unsigned char	TI:1; 	/* Transmit buffer empty flag 					*/
	 unsigned char	RE:1; 	/* Receive enable bit 							*/
	 unsigned char	RI:1; 	/* Receive complete flag 						*/
	 unsigned char	  :1; 	/* Nothing Assigned						 		*/
	 unsigned char	  :1; 	/* Nothing Assigned						 		*/
	 unsigned char	  :1; 	/* Nothing Assigned						 		*/
	 unsigned char	  :1; 	/* Nothing Assigned						 		*/
	} BIT;   		    	/*   						 		   			*/
	unsigned char BYTE;     /* Byte Access 									*/
}; 							/*UART0 transmit/receive control register 1 	*/

union st_u1c1 {             /* union U0C1	   								*/
	struct {            	/* Bit  Access	  	 							*/
	 unsigned char 	TE:1; 	/* Transmit enable bit 							*/
	 unsigned char	TI:1; 	/* Transmit buffer empty flag 					*/
	 unsigned char	RE:1; 	/* Receive enable bit 							*/
	 unsigned char	RI:1; 	/* Receive complete flag 						*/
	 unsigned char	  :1; 	/*  											*/
	 unsigned char	  :1; 	/*  											*/
	 unsigned char	  :1; 	/*  											*/
	 unsigned char	  :1; 	/*  											*/
	} BIT;   		     	/*   						 		   		    */
	 unsigned char BYTE;    /* Byte Access 								    */
}; 							/*UART1 transmit/receive control register 1     */

