simait/TinyTimber/env/m16c/iom16c62.h
/*------------------------------------------------------
    UART transmit/receive control register 2
------------------------------------------------------*/
union st_ucon {              	/* union UCON   							*/
	struct {             		/* Bit  Access	  	 						*/
	 unsigned char 	U0IRS :1; 	/* UART0 transmit interrupt cause select bit*/
	 unsigned char	U1IRS :1; 	/* UART1 transmit interrupt cause select bit*/
	 unsigned char	U0RRM :1; 	/* UART0 continuous receive mode enable bit */
	 unsigned char	U1RRM :1; 	/* UART1 continuous receive mode enable bit */
	 unsigned char	CLKMD0:1; 	/* CLK/CLKS select bit 0					*/
	 unsigned char	CLKMD1:1; 	/* CLK/CLKS select bit 1					*/
	 unsigned char		  :1; 	/* 											*/
	 unsigned char	      :1; 	/* 											*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;        /* Byte Access 								*/
}; 								/*UART transmit/receive control register 2  */



/*------------------------------------------------------
    Flash memory control register 1
------------------------------------------------------*/
union st_fmr1 {                  /* union FMR1    	   						 */
   struct {          			 /* Bit  Access 		   			 		 */
     unsigned char 	     :1; 	 /* 										 */
     unsigned char 	     :1; 	 /* 										 */
     unsigned char 	     :1; 	 /* 										 */
     unsigned char 	FMR13:1;  	 /* Flash memory power supply-OFF bit*/
     unsigned char 	     :1; 	 /* 										 */
     unsigned char 	     :1; 	 /* 										 */
     unsigned char 	     :1; 	 /* 										 */
     unsigned char 	     :1;     /* 										 */
   } BIT;   		  			 /*      						    	     */
   unsigned char BYTE;        	 /*  Byte Access 							 */
};                               /* Flash memory control register      	     */

/*------------------------------------------------------
    Flash memory control register 0
------------------------------------------------------*/
union st_fmr0 {              /* union FMR0    	   						 	*/
    struct {                 /* Bit  Access 		   			 				 */
     unsigned char 	FMR00:1; /* RY/BY~ status bit 							*/
     unsigned char 	FMR01:1; /* CPU rewrite mode select bit 				*/
     unsigned char 	FMR02:1; /* Lock bit disable bit 						*/
     unsigned char 	FMR03:1; /* Flash memory reset bit 						*/
     unsigned char 		 :1;
     unsigned char 	FMR05:1; /* User ROM area select bit 					*/
     unsigned char 	     :1;
     unsigned char 	     :1; /*												*/
   } BIT;   		  		 /*      						    			*/
   unsigned char BYTE;       /*  Byte Access 								*/
};                           /* Flash memory control register      			*/

/*------------------------------------------------------
    A/D control register 2
------------------------------------------------------*/
union st_adcon2 {				/* union ADCON2						*/
    struct {					/*  Bit  Access 					*/
	 unsigned char     SMP:1;	/* A/D conversion method select bit */
	 unsigned char    	:1;		/* Reserved bit (Always set to 0 )  */
	 unsigned char    	:1;		/* Reserved bit (Always set to 0 )  */
	 unsigned char    	:1;		/* Reserved bit (Always set to 0 )  */
	 unsigned char    	:1;		/* Nothing Assigned.		        */
	 unsigned char    	:1;		/* Nothing Assigned.		        */
	 unsigned char    	:1;		/* Nothing Assigned.		        */
	 unsigned char    	:1;		/* Nothing Assigned.		        */
	} BIT;
    unsigned char   BYTE;		/*  Byte Access 					*/
};


/*------------------------------------------------------
    A/D control register 0
------------------------------------------------------*/
union st_adcon0 {              	/* union ADCON0	   							*/
	struct {             		/* Bit  Access	  	 						*/
	 unsigned char 	CH0 :1; 	/* Analog input pin select bit 				*/
	 unsigned char	CH1 :1; 	/* Analog input pin select bit 				*/
	 unsigned char	CH2 :1; 	/* Analog input pin select bit 				*/
	 unsigned char	MD0 :1; 	/* A/D operation mode select bit 0 			*/
	 unsigned char	MD1 :1; 	/* A/D operation mode select bit 0 			*/
	 unsigned char	TRG :1; 	/* Trigger select bit 						*/
	 unsigned char	ADST:1; 	/* A/D conversion start flag 				*/
	 unsigned char	CKS0:1; 	/* Frequency select bit 0 					*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;         /* Byte Access 								*/
}; 								/*A/D control register 0					*/


/*------------------------------------------------------
   A/D control register 1
------------------------------------------------------*/
union st_adcon1 {              	/* union ADCON1	   							*/
	struct {             		/* Bit  Access	  	 						*/
	 unsigned char 	SCAN0:1; 	/* A/D sweep pin select bit 				*/
	 unsigned char	SCAN1:1; 	/* A/D sweep pin select bit 				*/
	 unsigned char	MD2  :1; 	/* A/D operation mode select bit 1 			*/
	 unsigned char	BITS :1; 	/* 8/10-bit mode select bit 				*/
	 unsigned char	CKS1 :1; 	/* Frequency select bit 1 					*/
	 unsigned char	VCUT :1; 	/* Vref connect bit							*/
	 unsigned char	OPA0 :1; 	/* External op-amp connection mode bit 		*/
	 unsigned char	OPA1 :1; 	/* External op-amp connection mode bit 		*/
	} BIT;   		     		/*   						 		   		*/
	unsigned char BYTE;         /* Byte Access 								*/
}; 								/*A-D control register 1					*/


/*------------------------------------------------------
    D/A control register
------------------------------------------------------*/
union st_dacon{               /* union DACON    	   					*/
	struct {              	  /* Bit  Access 		   				*/
	 unsigned char 	DA0E :1;  /* D/A0 output enable bit	 		    */
	 unsigned char	DA1E :1;  /* D/A1 output enable bit 			*/
	 unsigned char		 :1;  /* Nothing Assigned 					*/
	 unsigned char		 :1;  /* Nothing Assigned 					*/
	 unsigned char		 :1;  /* Nothing Assigned 					*/
	 unsigned char		 :1;  /* Nothing Assigned 					*/
	 unsigned char	 	 :1;  /* Nothing Assigned 					*/
	 unsigned char		 :1;  /* Nothing Assigned 					*/
	} BIT;   		      	  /*       						    	*/
	unsigned char BYTE;       /* Byte Access 						*/
};                            /* D/A control register				*/



