simait/TinyTimber/env/m16c/iom16c62.h
/*------------------------------------------------------
    Port P0 register
------------------------------------------------------*/
union st_p0 {               /* union P0    	   					*/
	struct {            	/* Bit  Access 		   				*/
	 unsigned char 	P0_0:1; /* Port P00 register 				*/
	 unsigned char	P0_1:1; /* Port P01 register 				*/
	 unsigned char	P0_2:1; /* Port P02 register 				*/
	 unsigned char	P0_3:1; /* Port P03 register 				*/
	 unsigned char	P0_4:1; /* Port P04 register 				*/
	 unsigned char	P0_5:1; /* Port P05 register 				*/
	 unsigned char	P0_6:1; /* Port P06 register 				*/
	 unsigned char	P0_7:1; /* Port P07 register 				*/
	} BIT;   		    	/*        						    */
	unsigned char BYTE;     /*  Byte Access 					*/
};                          /* 						            */

/*------------------------------------------------------
    Port P0 direction register
------------------------------------------------------*/
union st_pd0 {              /* union PD0    	   		   		*/
	struct {            	/* Bit  Access 		   	  	   		*/
	 unsigned char 	PD0_0:1;/* Port P00 direction register 		*/
	 unsigned char	PD0_1:1;/* Port P01 direction register 		*/
	 unsigned char	PD0_2:1;/* Port P02 direction register 		*/
	 unsigned char	PD0_3:1;/* Port P03 direction register 		*/
	 unsigned char	PD0_4:1;/* Port P04 direction register 		*/
	 unsigned char	PD0_5:1;/* Port P05 direction register 		*/
	 unsigned char	PD0_6:1;/* Port P06 direction register 		*/
	 unsigned char	PD0_7:1;/* Port P07 direction register 		*/
	} BIT;   		    	/*        					   		*/
	unsigned char BYTE;     /*  Byte Access 			   		*/
};                          /* 						       		*/

/*------------------------------------------------------
    Port P1 register
------------------------------------------------------*/
union st_p1 {              /* union P1	    	   		    	*/
	struct {           	   /* Bit  Access 		   	  	    	*/
	 unsigned char 	P1_0:1;/* Port P10 register			    	*/
	 unsigned char	P1_1:1;/* Port P11 register 				*/
	 unsigned char	P1_2:1;/* Port P12 register 				*/
	 unsigned char	P1_3:1;/* Port P13 register 				*/
	 unsigned char	P1_4:1;/* Port P14 register 				*/
	 unsigned char	P1_5:1;/* Port P15 register 				*/
	 unsigned char	P1_6:1;/* Port P16 register 				*/
	 unsigned char	P1_7:1;/* Port P17 register 				*/
	} BIT;   		       /*        					    	*/
	unsigned char BYTE;    /*  Byte Access 			        	*/
};                         /* 						        	*/

/*------------------------------------------------------
    Port P1 direction register
------------------------------------------------------*/
union st_pd1 {              /* union PD1    	   		   */
	struct {            	/* Bit  Access 		   	  	   */
	 unsigned char 	PD1_0:1;/* Port P10 direction register */
	 unsigned char	PD1_1:1;/* Port P11 direction register */
	 unsigned char	PD1_2:1;/* Port P12 direction register */
	 unsigned char	PD1_3:1;/* Port P13 direction register */
	 unsigned char	PD1_4:1;/* Port P14 direction register */
	 unsigned char	PD1_5:1;/* Port P15 direction register */
	 unsigned char	PD1_6:1;/* Port P16 direction register */
	 unsigned char	PD1_7:1;/* Port P17 direction register */
	} BIT;   		    	/*        					   */
	unsigned char BYTE;     /*  Byte Access 			   */
};                          /* 						       */

/*------------------------------------------------------
    Port P2 register
------------------------------------------------------*/
union st_p2 {              /* union P2	    	   		    */
	struct {           	   /* Bit  Access 		   	  	    */
	 unsigned char 	P2_0:1;/* Port P20 register			    */
	 unsigned char	P2_1:1;/* Port P21 register 			*/
	 unsigned char	P2_2:1;/* Port P22 register 			*/
	 unsigned char	P2_3:1;/* Port P23 register 			*/
	 unsigned char	P2_4:1;/* Port P24 register 			*/
	 unsigned char	P2_5:1;/* Port P25 register 			*/
	 unsigned char	P2_6:1;/* Port P26 register 			*/
	 unsigned char	P2_7:1;/* Port P27 register 			*/
	} BIT;   		  	   /*        					    */
	unsigned char BYTE;    /*  Byte Access 			       	*/
};                         /* 						        */

/*------------------------------------------------------
    Port P2 direction register
------------------------------------------------------*/
union st_pd2 {              /* union PD2    	   		   */
	struct {           	    /* Bit  Access 		   	  	   */
	 unsigned char 	PD2_0:1;/* Port P20 direction register */
	 unsigned char	PD2_1:1;/* Port P21 direction register */
	 unsigned char	PD2_2:1;/* Port P22 direction register */
	 unsigned char	PD2_3:1;/* Port P23 direction register */
	 unsigned char	PD2_4:1;/* Port P24 direction register */
	 unsigned char	PD2_5:1;/* Port P25 direction register */
	 unsigned char	PD2_6:1;/* Port P26 direction register */
	 unsigned char	PD2_7:1;/* Port P27 direction register */
		} BIT;   		    /*        					   */
	unsigned char BYTE;     /*  Byte Access 			   */
};                          /* 						       */

/*------------------------------------------------------
    Port P3 register
------------------------------------------------------*/
union st_p3 {              /* union P3	    	   		    */
	struct {           	   /* Bit  Access 		   	  	    */
	 unsigned char 	P3_0:1;/* Port P30 register			    */
	 unsigned char	P3_1:1;/* Port P31 register 			*/
	 unsigned char	P3_2:1;/* Port P32 register 			*/
	 unsigned char	P3_3:1;/* Port P33 register 			*/
	 unsigned char	P3_4:1;/* Port P34 register 			*/
	 unsigned char	P3_5:1;/* Port P35 register 			*/
	 unsigned char	P3_6:1;/* Port P36 register 			*/
	 unsigned char	P3_7:1;/* Port P37 register 			*/
	} BIT;   		   	   /*        					    */
	unsigned char BYTE;    /*  Byte Access 			        */
};                         /* 						        */

/*------------------------------------------------------
    Port P3 direction register
------------------------------------------------------*/
union st_pd3 {              /* union PD3    	   		   */
	struct {           	    /* Bit  Access 		   	  	   */
	 unsigned char 	PD3_0:1;/* Port P30 direction register */
	 unsigned char	PD3_1:1;/* Port P31 direction register */
	 unsigned char	PD3_2:1;/* Port P32 direction register */
	 unsigned char	PD3_3:1;/* Port P33 direction register */
	 unsigned char	PD3_4:1;/* Port P34 direction register */
	 unsigned char	PD3_5:1;/* Port P35 direction register */
	 unsigned char	PD3_6:1;/* Port P36 direction register */
	 unsigned char	PD3_7:1;/* Port P37 direction register */
	} BIT;   		        /*        					   */
	unsigned char BYTE;     /*  Byte Access 			   */
};                          /* 						       */

