simait/TinyTimber/env/m16c/iom16c62.h
/*------------------------------------------------------
    Port P4 register
------------------------------------------------------*/
union st_p4 {              /* union P4	    	   		    */
	struct {           	   /* Bit  Access 		   	  	    */
	 unsigned char 	P4_0:1;/* Port P40 register			    */
	 unsigned char	P4_1:1;/* Port P41 register 			*/
	 unsigned char	P4_2:1;/* Port P42 register 			*/
	 unsigned char	P4_3:1;/* Port P43 register 			*/
	 unsigned char	P4_4:1;/* Port P44 register 			*/
	 unsigned char	P4_5:1;/* Port P45 register 			*/
	 unsigned char	P4_6:1;/* Port P46 register 			*/
	 unsigned char	P4_7:1;/* Port P47 register 			*/
	} BIT;   		   	   /*        					    */
	unsigned char BYTE;    /*  Byte Access 			        */
};                         /* 						        */

/*------------------------------------------------------
    Port P4 direction register
------------------------------------------------------*/
union st_pd4 {              /* union PD4    	   		   */
	struct {            	/* Bit  Access 		   	  	   */
	 unsigned char 	PD4_0:1;/* Port P40 direction register */
	 unsigned char	PD4_1:1;/* Port P41 direction register */
	 unsigned char	PD4_2:1;/* Port P42 direction register */
	 unsigned char	PD4_3:1;/* Port P43 direction register */
	 unsigned char	PD4_4:1;/* Port P44 direction register */
	 unsigned char	PD4_5:1;/* Port P45 direction register */
	 unsigned char	PD4_6:1;/* Port P46 direction register */
	 unsigned char	PD4_7:1;/* Port P47 direction register */
	} BIT;   		    	/*        					   */
	unsigned char BYTE;    	/*  Byte Access 			   */
};                          /* 						       */

/*------------------------------------------------------
    Port P5 register
------------------------------------------------------*/
union st_p5 {              /* union P5	    	   		    */
	struct {           	   /* Bit  Access 		   	  	    */
	 unsigned char 	P5_0:1;/* Port P50 register			    */
	 unsigned char	P5_1:1;/* Port P51 register 			*/
	 unsigned char	P5_2:1;/* Port P52 register 			*/
	 unsigned char	P5_3:1;/* Port P53 register 			*/
	 unsigned char	P5_4:1;/* Port P54 register 			*/
	 unsigned char	P5_5:1;/* Port P55 register 			*/
	 unsigned char	P5_6:1;/* Port P56 register 			*/
	 unsigned char	P5_7:1;/* Port P57 register 			*/
	} BIT;   		       /*        					    */
	unsigned char BYTE;    /*  Byte Access 			        */
};                         /* 						        */

/*------------------------------------------------------
    Port P5 direction register
------------------------------------------------------*/
union st_pd5 {              /* union PD5    	   		   */
	struct {            	/* Bit  Access 		   	  	   */
	 unsigned char 	PD5_0:1;/* Port P50 direction register */
	 unsigned char	PD5_1:1;/* Port P51 direction register */
	 unsigned char	PD5_2:1;/* Port P52 direction register */
	 unsigned char	PD5_3:1;/* Port P53 direction register */
	 unsigned char	PD5_4:1;/* Port P54 direction register */
	 unsigned char	PD5_5:1;/* Port P55 direction register */
	 unsigned char	PD5_6:1;/* Port P56 direction register */
	 unsigned char	PD5_7:1;/* Port P57 direction register */
	} BIT;   		    	/*        					   */
	unsigned char BYTE;     /*  Byte Access 			   */
};                          /* 						       */

/*------------------------------------------------------
    Port P6 register
------------------------------------------------------*/
union st_p6 {              /* union P6	    	   		    */
	struct {           	   /* Bit  Access 		   	  	    */
	 unsigned char 	P6_0:1;/* Port P60 register			    */
	 unsigned char	P6_1:1;/* Port P61 register 			*/
	 unsigned char	P6_2:1;/* Port P62 register 			*/
	 unsigned char	P6_3:1;/* Port P63 register 			*/
	 unsigned char	P6_4:1;/* Port P64 register 			*/
	 unsigned char	P6_5:1;/* Port P65 register 			*/
	 unsigned char	P6_6:1;/* Port P66 register 			*/
	 unsigned char	P6_7:1;/* Port P67 register 			*/
	} BIT;   		       /*        					    */
	unsigned char BYTE;    /*  Byte Access 			        */
};                         /* 						        */

/*------------------------------------------------------
    Port P6 direction register
------------------------------------------------------*/
union st_pd6 {              /* union PD6    	   		   */
	struct {            	/* Bit  Access 		   	  	   */
	 unsigned char 	PD6_0:1;/* Port P60 direction register */
	 unsigned char	PD6_1:1;/* Port P61 direction register */
	 unsigned char	PD6_2:1;/* Port P62 direction register */
	 unsigned char	PD6_3:1;/* Port P63 direction register */
	 unsigned char	PD6_4:1;/* Port P64 direction register */
	 unsigned char	PD6_5:1;/* Port P65 direction register */
	 unsigned char	PD6_6:1;/* Port P66 direction register */
	 unsigned char	PD6_7:1;/* Port P67 direction register */
	} BIT;   		    	/*        					   */
	unsigned char BYTE;     /*  Byte Access 			   */
};                          /* 						       */

/*------------------------------------------------------
    Port P7 register
------------------------------------------------------*/
union st_p7 {              /* union P7	    	   		    */
	struct {               /* Bit  Access 		   	  	    */
	 unsigned char 	P7_0:1;/* Port P70 register			    */
	 unsigned char	P7_1:1;/* Port P71 register 			*/
	 unsigned char	P7_2:1;/* Port P72 register 			*/
	 unsigned char	P7_3:1;/* Port P73 register 			*/
	 unsigned char	P7_4:1;/* Port P74 register 			*/
	 unsigned char	P7_5:1;/* Port P75 register 			*/
	 unsigned char	P7_6:1;/* Port P76 register 			*/
	 unsigned char	P7_7:1;/* Port P77 register 			*/
	} BIT;   		   	   /*        					    */
	unsigned char BYTE;    /*  Byte Access 			        */
};                         /* 						        */

/*------------------------------------------------------
    Port P7 direction register
------------------------------------------------------*/
union st_pd7 {              /* union PD7    	   		   */
	struct {                /* Bit  Access 		   	  	   */
	 unsigned char 	PD7_0:1;/* Port P70 direction register */
	 unsigned char	PD7_1:1;/* Port P71 direction register */
	 unsigned char	PD7_2:1;/* Port P72 direction register */
	 unsigned char	PD7_3:1;/* Port P73 direction register */
	 unsigned char	PD7_4:1;/* Port P74 direction register */
	 unsigned char	PD7_5:1;/* Port P75 direction register */
	 unsigned char	PD7_6:1;/* Port P76 direction register */
	 unsigned char	PD7_7:1;/* Port P77 direction register */
		} BIT;   		    /*        					   */
	unsigned char BYTE;     /*  Byte Access 			   */
};                          /* 						       */

