simait/TinyTimber/env/m16c/iom16c62.h
/*------------------------------------------------------
    Port P8 register
------------------------------------------------------*/
union st_p8 {              /* union P8	    	   		    */
	struct {           	   /* Bit  Access 		   	  	    */
	 unsigned char 	P8_0:1;/* Port P80 register			    */
	 unsigned char	P8_1:1;/* Port P81 register 			*/
	 unsigned char	P8_2:1;/* Port P82 register 			*/
	 unsigned char	P8_3:1;/* Port P83 register 			*/
	 unsigned char	P8_4:1;/* Port P84 register 			*/
	 unsigned char	P8_5:1;/* Port P85 register 			*/
	 unsigned char	P8_6:1;/* Port P86 register 			*/
	 unsigned char	P8_7:1;/* Port P87 register 			*/
	} BIT;   		       /*        					    */
	unsigned char BYTE;    /*  Byte Access 			        */
};                         /* 						        */

/*------------------------------------------------------
    Port P8 direction register
------------------------------------------------------*/
union st_pd8 {              /* union PD8    	   		   */
	struct {            	/* Bit  Access 		   	  	   */
	 unsigned char 	PD8_0:1;/* Port P80 direction register */
	 unsigned char	PD8_1:1;/* Port P81 direction register */
	 unsigned char	PD8_2:1;/* Port P82 direction register */
	 unsigned char	PD8_3:1;/* Port P83 direction register */
	 unsigned char	PD8_4:1;/* Port P84 direction register */
	 unsigned char		 :1;/* Nothing assigned 		   */
	 unsigned char	PD8_6:1;/* Port P86 direction register */
	 unsigned char	PD8_7:1;/* Port P87 direction register */
	} BIT;   		    	/*        					   */
	unsigned char BYTE;     /*  Byte Access 			   */
};                          /* 						       */

/*------------------------------------------------------
    Port P9 register
------------------------------------------------------*/
union st_p9 {              /* union P9	    	   		    */
	struct {           	   /* Bit  Access 		   	  	    */
	 unsigned char 	P9_0:1;/* Port P90 register			    */
	 unsigned char 	P9_1:1;/* Port P91 register 			*/
	 unsigned char	P9_2:1;/* Port P92 register 			*/
	 unsigned char	P9_3:1;/* Port P93 register 			*/
	 unsigned char	P9_4:1;/* Port P94 register 			*/
	 unsigned char	P9_5:1;/* Port P95 register 			*/
	 unsigned char	P9_6:1;/* Port P96 register 			*/
	 unsigned char	P9_7:1;/* Port P97 register 			*/
	} BIT;   		   	   /*        					    */
	unsigned char BYTE;    /*  Byte Access 			        */
};                         /* 						        */

/*------------------------------------------------------
    Port P9 direction register
------------------------------------------------------*/
union st_pd9 {              /* union PD9    	   		   */
	struct {            	/* Bit  Access 		   	  	   */
	 unsigned char 	PD9_0:1;/* Port P90 direction register */
	 unsigned char	PD9_1:1;/* Port P91 direction register */
	 unsigned char	PD9_2:1;/* Port P92 direction register */
	 unsigned char	PD9_3:1;/* Port P93 direction register */
	 unsigned char	PD9_4:1;/* Port P94 direction register */
	 unsigned char	PD9_5:1;/* Port P95 direction register */
	 unsigned char	PD9_6:1;/* Port P96 direction register */
	 unsigned char	PD9_7:1;/* Port P97 direction register */
	} BIT;   		    	/*        					   */
	unsigned char BYTE;     /*  Byte Access 			   */
};                          /* 						       */

/*------------------------------------------------------
    Port P10 register
------------------------------------------------------*/
union st_p10 {              /* union P10	    	   						*/
	struct {            	/* Bit  Access 		   	  	    				*/
	 unsigned char 	P10_0:1;/* Port P100 register							*/
	 unsigned char	P10_1:1;/* Port P101 register 							*/
	 unsigned char	P10_2:1;/* Port P102 register 							*/
	 unsigned char	P10_3:1;/* Port P103 register 							*/
	 unsigned char	P10_4:1;/* Port P104 register 							*/
	 unsigned char	P10_5:1;/* Port P105 register 							*/
	 unsigned char	P10_6:1;/* Port P106 register 							*/
	 unsigned char	P10_7:1;/* Port P107 register 							*/
	} BIT;   		    	/*        					    				*/
	unsigned char BYTE;     /*  Byte Access 			    				*/
};                          /* 						        */

/*------------------------------------------------------
    Port P10 direction register
------------------------------------------------------*/
union st_pd10 {              /* union PD10    	   		     				*/
	struct {            	 /* Bit  Access 		   	  	 				*/
	 unsigned char 	PD10_0:1;/* Port P100 direction register 				*/
	 unsigned char	PD10_1:1;/* Port P101 direction register 				*/
	 unsigned char	PD10_2:1;/* Port P102 direction register 				*/
	 unsigned char	PD10_3:1;/* Port P103 direction register 				*/
	 unsigned char	PD10_4:1;/* Port P104 direction register 				*/
	 unsigned char	PD10_5:1;/* Port P105 direction register 				*/
	 unsigned char	PD10_6:1;/* Port P106 direction register 				*/
	 unsigned char	PD10_7:1;/* Port P107 direction register 				*/
	} BIT;   		    	 /*        					     				*/
	unsigned char BYTE;      /*  Byte Access 			     				*/
};                           /* 						     				*/

/*------------------------------------------------------
    Pull-up control register 0
------------------------------------------------------*/
union st_pur0 {            /* union PUR0    	   		   					*/
	struct {               /* Bit  Access 		   	  	   					*/
	 unsigned char 	PU00:1;/* P00 to P03 pull-up		   					*/
	 unsigned char	PU01:1;/* P04 to P07 pull-up		   					*/
	 unsigned char	PU02:1;/* P10 to P13 pull-up		   					*/
	 unsigned char	PU03:1;/* P14 to P17 pull-up		   					*/
	 unsigned char	PU04:1;/* P20 to P23 pull-up		   					*/
	 unsigned char	PU05:1;/* P24 to P27 pull-up		   					*/
	 unsigned char	PU06:1;/* P30 to P33 pull-up		   					*/
	 unsigned char	PU07:1;/* P34 to P37 pull-up		   					*/
	} BIT;   		       /*        					   					*/
	unsigned char BYTE;    /*  Byte Access 			   	   					*/
};                         /* 						       					*/

