simait/TinyTimber/env/m16c/iom16c62.h
/*------------------------------------------------------
    Pull-up control register 1
------------------------------------------------------*/
union st_pur1 {            /* union PUR1    	   		   					*/
	struct {           	   /* Bit  Access 		   	  	   					*/
	 unsigned char 	PU10:1;/* P40 to P43 pull-up 		   					*/
	 unsigned char	PU11:1;/* P44 to P47 pull-up 		   					*/
	 unsigned char	PU12:1;/* P50 to P53 pull-up 		   					*/
	 unsigned char	PU13:1;/* P54 to P57 pull-up 		   					*/
	 unsigned char	PU14:1;/* P60 to P63 pull-up 		   					*/
	 unsigned char	PU15:1;/* P64 to P67 pull-up 		   					*/
	 unsigned char	PU16:1;/* P70 to P73 pull-up (Except P70,P71 ; P70,P71 -> N-channel open drain ports)*/
	 unsigned char	PU17:1;/* P74 to P77 pull-up 		   					*/
	} BIT;   		       /*        					   					*/
	unsigned char BYTE;    /*  Byte Access 			   						*/
};                         /* 						       					*/

/*------------------------------------------------------
    Pull-up control register 2
------------------------------------------------------*/
union st_pur2 {            /* union PUR2    	   		     				*/
	struct {           	   /* Bit  Access 		   	  	     				*/
	 unsigned char 	PU20:1;/* P80 to P83 pull-up 			 				*/
	 unsigned char	PU21:1;/* P84 to P87 pull-up (Except P85)				*/
	 unsigned char	PU22:1;/* P90 to P93 pull-up 			 				*/
	 unsigned char	PU23:1;/* P94 to P97 pull-up			 				*/
	 unsigned char	PU24:1;/* P100 to P103 pull-up 			 				*/
	 unsigned char	PU25:1;/* P104 to P107 pull-up 			 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	} BIT;   		   	   /*        					     				*/
	unsigned char BYTE;    /*  Byte Access 			   		 				*/
};                         /* 						         				*/

/*------------------------------------------------------
    Port control register
------------------------------------------------------*/
union st_pcr {             /* union PCR2    	   		     				*/
	struct {           	   /* Bit  Access 		   	  	     				*/
	 unsigned char 	PCR0:1;/* Port P1 control register 		 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	 unsigned char		:1;/* Nothing assigned 				 				*/
	} BIT;   		   	   /*        					     				*/
	unsigned char BYTE;    /*  Byte Access 			   		 				*/
};                         /* 						         				*/

/*------------------------------------------------------
     bcnic
------------------------------------------------------*/
union st_bcnic {					/*    interrupt control registers*/
    struct{
     unsigned char    ILVL0_BCNIC:1;/* Interrupt priority level select bit */
     unsigned char    ILVL1_BCNIC:1;/* Interrupt priority level select bit */
     unsigned char    ILVL2_BCNIC:1;/* Interrupt priority level select bit */
     unsigned char    IR_BCNIC   :1;/* Interrupt request bit */
     unsigned char    		     :1;
     unsigned char               :1;
     unsigned char               :1;
     unsigned char               :1;
    }BIT;
    unsigned char    BYTE;
};

/*------------------------------------------------------
     dm0ic
------------------------------------------------------*/
union st_dm0ic {					/*    interrupt control registers*/
    struct{
     unsigned char    ILVL0_DM0IC:1;/* Interrupt priority level select bit */
     unsigned char    ILVL1_DM0IC:1;/* Interrupt priority level select bit */
     unsigned char    ILVL2_DM0IC:1;/* Interrupt priority level select bit */
     unsigned char    IR_DM0IC   :1;/* Interrupt request bit			   */
     unsigned char    		     :1;
     unsigned char               :1;
     unsigned char               :1;
     unsigned char               :1;
    }BIT;
    unsigned char    BYTE;
};



/* Processor mode register 0 */
#define PM0   (*(volatile union st_pm0 *)(0x0004))

/* Processor mode register 1 */
#define PM1   (*(volatile union st_pm1 *)(0x0005))

/* System clock control register 0 */
#define CM0   (*(volatile union st_cm0 *)(0x0006))

/* System clock control register 1 */
#define CM1   (*(volatile union st_cm1 *)(0x0007))

/* Chip select control register */
#define CSR   (*(volatile union st_csr *)(0x0008))

/* Address match interrupt enable register */
#define AIER  (*(volatile union st_aier *)(0x0009))

/* Protect register */
#define PRCR  (*(volatile union st_prcr *)(0x000A))

/* Watchdog timer start register */
#define WDTS  (*(volatile unsigned char *)(0x000E))

/* Watchdog timer control register */
#define WDC  (*(volatile union st_wdc *)(0x000F))

/* Address match interrupt register 0 */
#define RMAD0 (*(volatile union st_rmad0 *)(0x0010))

/* Address match interrupt register 1 */
#define RMAD1 (*(volatile union st_rmad1 *)(0x0014))

/* DMA0 source pointer */
#define SAR0  (*(volatile union st_sar0 *)(0x0020))

/* DMA0 destination pointer */
#define DAR0  (*(volatile union st_dar0 *)(0x0024))

/* DMA0 transfer counter */
#define TCR0  (*(volatile union st_tcr0  *)(0x0028))

 /* DMA0 control register */
#define DM0CON (*(volatile union st_dm0con  *)(0x002C))

/* DMA1 source pointer */
#define SAR1  (*(volatile union st_sar1 *)(0x0030))

/* DMA1 destination pointer */
#define DAR1  (*(volatile union st_dar1 *)(0x0034))

 /* DMA1 transfer counter */
#define TCR1  (*(volatile union st_tcr1 *)(0x0038))

/* DMA1 control register */
#define DM1CON  (*(volatile union st_dm1con *)(0x003c))


/* INT3~ interrupt control register */
#define INT3IC  (*(volatile union st_icr *)(0x0044))

/* Timer B5 interrupt control register */
#define TB5IC  (*(volatile union st_icr *)(0x0045))

/* Timer B4 interrupt control register */
#define TB4IC  (*(volatile union st_icr *)(0x0046))

