simait/TinyTimber/env/m16c/iom16c62.h
/* Timer B3 interrupt control register */
#define TB3IC  (*(volatile union st_icr *)(0x0047))

/* SI/O4 interrupt control register */
#define S4IC  (*(volatile union st_icr *)(0x0048))

/* SI/O3 interrupt control register */
#define S3IC  (*(volatile union st_icr *)(0x0049))

/* INT5~ interrupt control register */
#define INT5IC  (*(volatile union st_icr *)(0x0048))

/* INT4~ interrupt control register */
#define INT4IC  (*(volatile union st_icr *)(0x0049))

/* Bus collision detection interrupt control register */
#define BCNIC  (*(volatile union st_bcnic *)(0x004a))

/* DMA0 interrupt control register */
#define DM0IC  (*(volatile union st_dm0ic *)(0x004b))

/* DMA1 interrupt control register */
#define DM1IC  (*(volatile union st_icr *)(0x004c))

/* Key input interrupt control register */
#define KUPIC  (*(volatile union st_icr *)(0x004D))

/* A/D conversion interrupt control register */
#define ADIC  (*(volatile union st_icr *)(0x004E))

/* UART2 transmit interrupt control register */
#define S2TIC  (*(volatile union st_icr *)(0x004F))

/* UART2 receive interrupt control register */
#define S2RIC  (*(volatile union st_icr *)(0x0050))

/* UART0 transmit interrupt control register */
#define S0TIC  (*(volatile union st_icr *)(0x0051))

/* UART0 receive interrupt control register */
#define S0RIC  (*(volatile union st_icr *)(0x0052))

/* UART1 transmit interrupt control register */
#define S1TIC (*(volatile union st_icr *)(0x0053))

/* UART1 receive interrupt control register */
#define S1RIC  (*(volatile union st_icr *)(0x0054))

/* Timer A0 interrupt control register */
#define TA0IC  (*(volatile union st_icr *)(0x0055))

/* Timer A1 interrupt control register */
#define TA1IC  (*(volatile union st_icr *)(0x0056))

/* Timer A2 interrupt control register */
#define TA2IC (*(volatile union st_icr *)(0x0057))

/* Timer A3 interrupt control register */
#define TA3IC  (*(volatile union st_icr *)(0x0058))

/* Timer A4 interrupt control register */
#define TA4IC  (*(volatile union st_icr *)(0x0059))

/* Timer B0 interrupt control register */
#define TB0IC  (*(volatile union st_icr *)(0x005A))

/* Timer B1 interrupt control register */
#define TB1IC  (*(volatile union st_icr *)(0x005B))

/* Timer B2 interrupt control register */
#define TB2IC  (*(volatile union st_icr *)(0x005C))

/* INT0~ interrupt control register */
#define INT0IC (*(volatile union st_icr *)(0x005D))

/* INT1~ interrupt control register */
#define INT1IC  (*(volatile union st_icr *)(0x005E))

/* INT2~ interrupt control register */
#define INT2IC  (*(volatile union st_icr *)(0x005F))

/* Timer B3,4,5 count start flag */
#define TBSR  (*(volatile union st_tbsr *)(0x0340))


/********************************************************
*   declare  SFR short                                  *
********************************************************/
/*--------------------------------------------------------
    Timer registers : Read and write data in 16-bit units.
--------------------------------------------------------*/

/* Timer A1-1 register */
#define TA1_1  (*(volatile unsigned short *)(0x0342))

/* Timer A2-1 register */
#define TA2_1  (*(volatile unsigned short *)(0x0344))

/* Timer A4-1 register */
#define TA4_1  (*(volatile unsigned short *)(0x0346))

/* Three-phase PWM control regester 0 */
#define INVC0  (*(volatile union st_invc0 *)(0x0348))

 /* Three-phase PWM control register 1 */
#define INVC1  (*(volatile union st_invc1 *)(0x0349))

/* Three-phase output buffer register 0 */
#define IDB0  (*(volatile union st_idb0 *)(0x034a))

/* Three-phase output buffer register 1 */
#define IDB1  (*(volatile union st_idb1 *)(0x034b))

/*------------------------------------------------------
     Dead time timer ; Use "MOV" instruction when writing to this register.
------------------------------------------------------*/
/* Dead time timer */
#define DTT  (*(volatile unsigned char *)(0x034c))

/*------------------------------------------------------------------
   Timer B2 interrupt occurrences frequency set counter
   ; Use "MOV" instruction when writing to this register.
-------------------------------------------------------------------*/
/* Timer B2 interrupt occurrences frequency set counter */
#define ICTB2  (*(volatile unsigned char *)(0x034d))


/* Timer B3 register */
#define TB3  (*(volatile unsigned short *)(0x0350))

/* Timer B4 register */
#define TB4  (*(volatile unsigned short *)(0x0352))

/* Timer B5 register */
#define TB5  (*(volatile unsigned short *)(0x0354))

/* Timer B3 mode register */
#define TB3MR  (*(volatile union st_tmr *)(0x035b))

/* Timer B4 mode register */
#define TB4MR  (*(volatile union st_tmr *)(0x035c))

/* Timer B5 mode register */
#define TB5MR  (*(volatile union st_tmr *)(0x035d))

/* Interrupt cause select register */
#define IFSR  (*(volatile union st_ifsr *)(0x035f))

/* SI/O3i transmit/receive register (i=3,4)*/
#define S3TRR  (*(volatile unsigned char *)(0x0360))

/* SI/O3 control register */
#define S3C  (*(volatile union st_s3c *)(0x0362))


/* SI/O3 bit rate generator (Use "MOV" instruction when writing to these registers)*/
#define S3BRG  (*(volatile unsigned char *)(0x0363))


/* SI/O4 transmit/receive register */
#define S4TRR  (*(volatile unsigned char *)(0x0364))

/* SI/O4 control register */
#define S4C  (*(volatile union st_s4c *)(0x0366))

/* SI/O4 bit rate generator */
#define S4BRG  (*(volatile unsigned char *)(0x0367))




/* UART2 special mode register 3 */
#define U2SMR3  (*(volatile union st_u2smr3 *)(0x0375))


/* UART2 special mode register 2 */
#define U2SMR2  (*(volatile union st_u2smr2 *)(0x0376))

/* UART2 special mode register */
#define U2SMR  (*(volatile union st_u2smr *)(0x0377))

/* UART2 transmit/receive mode register */
#define U2MR  (*(volatile union st_u2mr *)(0x0378))

/* UART2 bit rate generator */
#define U2BRG  (*(volatile unsigned char *)(0x0379))

/* UART2 transmit buffer register */
#define U2TB  (*(volatile union st_u2tb *)(0x037a))

