simait/TinyTimber/env/m16c/iom16c62.h
/* UART2 transmit/receive control register 0 */
//#pragma ADDRESS     u2c0_addr   037cH
#define U2C0  (*(volatile union st_u2c0 *)(0x037c))

/* UART2 transmit/receive control register 1 */
#define U2C1  (*(volatile union st_u2c1 *)(0x037d))

/* UART2 receive buffer register */
#define U2RB  (*(volatile union st_u2rb *)(0x037e))


/* Count start flag */
#define TABSR  (*(volatile union st_tabsr *)(0x0380))

/* Clock prescaler reset flag */
#define CPSRF  (*(volatile union st_cpsrf *)(0x0381))


/* One-shot start flag */
#define ONSF  (*(volatile union st_onsf *)(0x0382))


/* Trigger select register */
#define TRGSR  (*(volatile union st_trgsr *)(0x0383))


/* Up/down flag (Use "MOV" instruction when writing to this register.)*/
#define UDF  (*(volatile unsigned char *)(0x0384))






/* Timer A0 register */
#define TA0 (*(volatile unsigned short  *)(0x0386))

/* Timer A1 register */
#define TA1 (*(volatile unsigned short  *)(0x0388))

/* Timer A2 register */
#define TA2 (*(volatile unsigned short  *)(0x038a))

/* Timer A3 register */
#define TA3 (*(volatile unsigned short  *)(0x038c))

/* Timer A4 register */
#define TA4 (*(volatile unsigned short  *)(0x038e))

/* Timer B0 register */
#define TB0 (*(volatile unsigned short  *)(0x0390))

/* Timer B1 register */
#define TB1 (*(volatile unsigned short  *)(0x0392))

/* Timer B2 register */
#define TB2 (*(volatile unsigned short  *)(0x0394))



 /* Timer A0 mode register */
#define TA0MR  (*(volatile union st_tmr *)(0x0396))

/* Timer A1 mode register */
#define TA1MR  (*(volatile union st_tmr *)(0x0397))

/* Timer A2 mode register */
#define TA2MR  (*(volatile union st_tmr *)(0x0398))

/* Timer A3 mode register */
#define TA3MR  (*(volatile union st_tmr *)(0x0399))

/* Timer A4 mode register */
#define TA4MR  (*(volatile union st_tmr *)(0x039A))

/* Timer B0 mode register */
#define TB0MR  (*(volatile union st_tmr *)(0x039b))

/* Timer B1 mode register */
#define TB1MR  (*(volatile union st_tmr *)(0x039c))

/* Timer B2 mode register */
#define TB2MR  (*(volatile union st_tmr *)(0x039d))



/* UART0 transmit/receive mode register */
#define U0MR  (*(volatile union st_u0mr *)(0x03a0))

/* UART0 bit rate generator (Use "MOV" instruction when writing to these registers.)*/
#define U0BRG  (*(volatile unsigned char *)(0x03a1))

/* UART0 transmit buffer register */
#define U0TB  (*(volatile union st_u0tb *)(0x03a2))

/* UART0 transmit/receive control register 0 */
#define U0C0  (*(volatile union st_u0c0 *)(0x03a4))

 /* UART0 transmit/receive control register 1 */
#define U0C1  (*(volatile union st_u0c1 *)(0x03a5))

/* UART0 receive buffer register */
#define U0RB  (*(volatile union st_u0rb *)(0x03a6))

/* UART1 transmit/receive mode register */
#define U1MR  (*(volatile union st_u1mr *)(0x03a8))

/* UART1 bit rate generator */
#define U1BRG  (*(volatile unsigned char *)(0x03a9))

 /* UART1 transmit buffer register */
#define U1TB  (*(volatile union st_u1tb *)(0x03aa))

/* UART1 transmit/receive control register 0 */
#define U1C0  (*(volatile union st_u1c0 *)(0x03ac))

 /* UART1 transmit/receive control register 1 */
#define U1C1  (*(volatile union st_u1c1 *)(0x03ad))

 /* UART1 receive buffer register */
#define U1RB  (*(volatile union st_u1rb *)(0x03ae))

/* UART transmit/receive control register 2 */
#define UCON  (*(volatile union st_ucon *)(0x03b0))


/* Flash memory control register 1 */
#define FMR1  (*(volatile union st_fmr1 *)(0x03b6))

/* Flash memory control register 0 */
#define FMR0  (*(volatile union st_fmr0 *)(0x03b7))

/* DMA0 cause select register */
#define DM0SL  (*(volatile union st_dm0sl *)(0x03b8))

/* DMA1 cause select register */
#define DM1SL  (*(volatile union st_dm1sl *)(0x03ba))

/* CRC data register */
#define CRCD  (*(volatile union st_crcd *)(0x03bc))

/* CRC input register */
#define CRCIN  (*(volatile union st_crcin*)(0x03be))





/* A/D register 0 */
#define AD0  (*(volatile union st_ad0 *)(0x03c0))

/* A/D register 1 */
#define AD1  (*(volatile union st_ad1 *)(0x03c2))

/* A/D register 2 */
#define AD2  (*(volatile union st_ad2 *)(0x03c4))

/* A/D register 3 */
#define AD3  (*(volatile union st_ad3 *)(0x03c6))

/* A/D register 4 */
#define AD4  (*(volatile union st_ad4 *)(0x03c8))

/* A/D register 5 */
#define AD5  (*(volatile union st_ad5 *)(0x03ca))

/* A/D register 6 */
#define AD6  (*(volatile union st_ad6 *)(0x03cc))

 /* A/D register 7 */
#define AD7  (*(volatile union st_ad7 *)(0x03ce))

/* A/D control register 2 */
#define ADCON2  (*(volatile union st_adcon2 *)(0x03d4))

/* A/D control register 0 */
#define ADCON0  (*(volatile union st_adcon0 *)(0x03d6))

/* A/D control register 1 */
#define ADCON1  (*(volatile union st_adcon1 *)(0x03d7))

/* D/A register 0 */
#define DA0  (*(volatile unsigned char *)(0x03d8))

/* D/A register 1 */
#define DA1  (*(volatile unsigned char *)(0x03da))

/* D/A control register */
#define DACON  (*(volatile union st_dacon *)(0x03dc))

/* Port P0 register */
#define P0  (*(volatile union st_p0 *)(0x03e0))

/* Port P1 register */
#define P1  (*(volatile union st_p1 *)(0x03e1))

/* Port P0 direction register */
#define PD0  (*(volatile union st_pd0 *)(0x03e2))

/* Port P1 direction register */
#define PD1  (*(volatile union st_pd1 *)(0x03e3))

/* Port P2 register */
#define P2  (*(volatile union st_p2 *)(0x03e4))

/* Port P3 register */
#define P3  (*(volatile union st_p3 *)(0x03e5))

/* Port P2 direction register */
#define PD2  (*(volatile union st_pd2 *)(0x03e6))

/* Port P3 direction register */
#define PD3  (*(volatile union st_pd3 *)(0x03e7))


 /* Port P4 register */
#define P4  (*(volatile union st_p4 *)(0x03e8))

/* Port P5 register */
#define P5  (*(volatile union st_p5 *)(0x03e9))

/* Port P4 direction register */
#define PD4  (*(volatile union st_pd4 *)(0x03ea))

/* Port P5 direction register */
#define PD5  (*(volatile union st_pd5 *)(0x03eb))

/* Port P6 register */
#define P6  (*(volatile union st_p6 *)(0x03ec))

/* Port P7 register */
#define P7  (*(volatile union st_p7 *)(0x03ed))

/* Port P6 direction register */
#define PD6  (*(volatile union st_pd6 *)(0x03ee))

/* Port P7 direction register */
#define PD7  (*(volatile union st_pd7 *)(0x03ef))

/* Port P8 register */
#define P8  (*(volatile union st_p8 *)(0x03f0))

/* Port P9 register */
#define P9  (*(volatile union st_p9 *)(0x03f1))

/* Port P8 direction register */
#define PD8  (*(volatile union st_pd8 *)(0x03f2))

/* Port P9 direction register */
#define PD9  (*(volatile union st_pd9 *)(0x03f3))

/* Port P10 register */
#define P10  (*(volatile union st_p10 *)(0x03f4))

/* Port P10 direction register */
#define PD10  (*(volatile union st_pd10 *)(0x03f6))

 /* Pull-up control register 0 */
#define PUR0  (*(volatile union st_pur0 *)(0x03fc))

/* Pull-up control register 1 */
#define PUR1  (*(volatile union st_pur1 *)(0x03fd))

 /* Pull-up control register 2 */
#define PUR2  (*(volatile union st_pur2 *)(0x03fe))

/* Port control register */
#define PCR  (*(volatile union st_pcr *)(0x03ff))
